{
    ".authorMsg": "- Phiên bản được phát triển bởi MeoU",
    "DualShock Calibration GUI": "DualSense Controller",
    "Unsupported browser. Please use a web browser with WebHID support (e.g. Chrome).": "Trình duyệt không được hỗ trợ. Vui lòng sử dụng trình duyệt có hỗ trợ WebHID (ví dụ: Google Chrome).",
    "Connect": "Kết Nối",
    "Connected to:": "Đã kết nối với:",
    "Disconnect": "Ngắt Kết Nối",
    "Calibrate stick center": "Hiệu chỉnh Điểm Trung Tâm Cần Analog",
    "Calibrate stick range": "Hiệu chỉnh Phạm Vi Cần Analog",
    "Sections below are not useful, just some debug infos or manual commands": "Các mục dưới đây chỉ chứa thông tin gỡ lỗi (debug) hoặc lệnh thủ công, không cần thiết cho người dùng thông thường",
    "NVS Status": "Trạng Thái NVS",
    "Unknown": "Không xác định",
    "Debug buttons": "Nút Gỡ Lỗi (Debug)",
    "Query NVS status": "Truy vấn Trạng Thái NVS",
    "NVS unlock": "Mở khóa NVS",
    "NVS lock": "Khóa NVS",
    "Stick center calibration": "Hiệu chỉnh Điểm Trung Tâm Cần Analog",
    "Welcome": "Chào Mừng",
    "Step 1": "Bước 1",
    "Step 2": "Bước 2",
    "Step 3": "Bước 3",
    "Step 4": "Bước 4",
    "Completed": "Hoàn thành",
    "Welcome to the stick center-calibration wizard!": "Chào mừng bạn đến với trình hướng dẫn hiệu chỉnh điểm trung tâm của cần analog!",
    "This tool will guide you in re-centering the analog sticks of your controller. It consists of four steps: you will be asked to move both sticks in a direction and release them.": "Công cụ này sẽ hướng dẫn bạn cách căn chỉnh lại điểm trung tâm của cần analog trên tay cầm. Quá trình gồm bốn bước: bạn sẽ được yêu cầu di chuyển cả hai cần analog theo một hướng rồi thả chúng ra.",
    "Please be aware that, <i>once the calibration is running, it cannot be canceled</i>. Do not close this page or disconnect your controller until it is completed.": "Lưu ý rằng, <i>một khi quá trình hiệu chỉnh đã bắt đầu, nó không thể bị hủy</i>. Vui lòng không đóng trang này hoặc ngắt kết nối tay cầm cho đến khi hoàn tất.",
    "Press <b>Start</b> to begin calibration.": "Nhấn <b>Bắt Đầu</b> để tiến hành hiệu chỉnh.",
    "Please move both sticks to the <b>top-left corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog lên <b>góc trên bên trái</b> rồi thả chúng ra.",
    "When the sticks are back in the center, press <b>Continue</b>.": "Khi các cần analog đã trở về vị trí trung tâm, nhấn <b>Tiếp Tục</b>.",
    "Please move both sticks to the <b>top-right corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog lên <b>góc trên bên phải</b> rồi thả chúng ra.",
    "Please move both sticks to the <b>bottom-left corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog xuống <b>góc dưới bên trái</b> rồi thả chúng ra.",
    "Please move both sticks to the <b>bottom-right corner</b> and release them.": "Vui lòng di chuyển cả hai cần analog xuống <b>góc dưới bên phải</b> rồi thả chúng ra.",
    "Calibration completed successfully!": "Hiệu chỉnh đã hoàn tất thành công!",
    "Next": "Tiếp",
    "Recentering the controller sticks.": "Đang căn chỉnh lại trung tâm của các cần analog.",
    "Please do not close this window and do not disconnect your controller. ": "Vui lòng không đóng cửa sổ này và không ngắt kết nối tay cầm. ",
    "Range calibration": "Hiệu chỉnh Phạm vi",
    "<b>The controller is now sampling data!</b>": "<b>Tay cầm đang lấy mẫu dữ liệu!</b>",
    "Done": "Hoàn tất",
    "Hi, thank you for using this software.": "Chào bạn, cảm ơn bạn đã sử dụng phần mềm này.",
    "If you're finding it helpful and you want to support my efforts, feel free to": "Nếu bạn thấy nó hữu ích và muốn ủng hộ công sức của tôi, đừng ngần ngại",
    "buy me a coffee": "mời tôi một ly cà phê",
    "! :)": "! :)",
    "Do you have any suggestion or issue? Drop me a message via email or discord.": "Bạn có đề xuất hay gặp vấn đề gì không? Gửi tin nhắn cho tôi qua email hoặc Discord nhé.",
    "Cheers!": "Chúc vui!",
    "Support this project": "Ủng hộ dự án này",
    "unknown": "không rõ",
    "original": "chính hãng",
    "clone": "hàng nhái",
    "locked": "đã khóa",
    "unlocked": "đã mở khóa",
    "error": "lỗi",
    "Build Date": "Ngày Build",
    "HW Version": "Phiên bản Phần cứng (HW)",
    "SW Version": "Phiên bản Phần mềm (SW)",
    "Device Type": "Loại Thiết Bị",
    "Range calibration completed": "Hiệu chỉnh phạm vi hoàn tất",
    "Range calibration failed": "Hiệu chỉnh phạm vi thất bại",
    "Stick calibration failed": "Hiệu chỉnh cần analog thất bại",
    "Stick calibration completed": "Hiệu chỉnh cần analog hoàn tất",
    "NVS Lock failed": "Khóa NVS thất bại",
    "NVS Unlock failed": "Mở khóa NVS thất bại",
    "Please connect only one controller at time.": "Vui lòng chỉ kết nối một tay cầm mỗi lần thôi nhé.",
    "Sony DualShock 4 V1": "Sony DualShock 4 V1",
    "Sony DualShock 4 V2": "Sony DualShock 4 V2",
    "Sony DualSense": "Sony DualSense",
    "Sony DualSense Edge": "Sony DualSense Edge",
    "Connected invalid device": "Đã kết nối thiết bị không hợp lệ",
    "Error": "Lỗi",
    "My handle on discord is: the_al": "Tên Discord của tôi là: the_al",
    "Initializing...": "Đang khởi tạo...",
    "Storing calibration...": "Đang lưu trữ dữ liệu hiệu chỉnh...",
    "Sampling...": "Đang lấy mẫu...",
    "Calibration in progress": "Đang tiến hành hiệu chỉnh",
    "Start": "Bắt Đầu",
    "Continue": "Tiếp Tục",
    "You can check the calibration with the": "Bạn có thể kiểm tra kết quả hiệu chỉnh bằng công cụ",
    "Have a nice day :)": "Chúc bạn một ngày tốt lành! :)",
    "Welcome to the Calibration GUI": "Chào mừng bạn đến với Giao Diện Hiệu Chỉnh (GUI)",
    "Just few things to know before you can start:": "Một vài điều cần biết trước khi bạn bắt đầu:",
    "This website is not affiliated with Sony, PlayStation &amp; co.": "Trang web này thuộc quyền sở hữu của MeoU đồng thời nó không phải là một sản phẩm chính thức từ Sony.",
    "This service is provided without warranty. Use at your own risk.": "Công cụ này được cung cấp không bảo hành. Bạn sẽ tự chịu rủi ro khi sử dụng do đó hãy cân nhắc. ",
    "Keep the internal battery of the controller connected and ensure it is well charged. If the battery dies during operations, the controller will be damaged and rendered unusable.": "Đảm bảo pin đã được sạc đầy. Nếu hết pin trong quá trình thực hiện hiệu chỉnh, tay cầm có thể bị hỏng và không sử dụng được.",
    "Before doing the permanent calibration, try the temporary one to ensure that everything is working well.": "Trước khi thực hiện hiệu chỉnh vĩnh viễn, hãy thử hiệu chỉnh tạm thời trước để đảm bảo mọi thứ hoạt động tốt.",
    "Understood": "Đã rõ",
    "Version": "Phiên bản",
    "Frequently Asked Questions": "Các Câu Hỏi Thường Gặp (F.A.Q.)",
    "Close": "Đóng",
    "Welcome to the F.A.Q. section! Below, you'll find answers to some of the most commonly asked questions about this website. If you have any other inquiries or need further assistance, feel free to reach out to me directly. Your feedback and questions are always welcome!": "Chào mừng bạn đến với mục Câu Hỏi Thường Gặp! Dưới đây là câu trả lời cho những thắc mắc phổ biến nhất về trang web này. Nếu bạn có bất kỳ câu hỏi nào khác hoặc cần hỗ trợ thêm, đừng ngần ngại liên hệ trực tiếp với tôi. Mọi phản hồi và câu hỏi của bạn luôn được đón nhận!",
    "How does it work?": "Nó hoạt động như thế nào?",
    "Behind the scenes, this website is the culmination of one year of dedicated effort in reverse-engineering DualShock controllers for fun/hobby from a random guy on the internet.": "Đằng sau, trang web này là thành quả của một năm nỗ lực đảo ngược kỹ thuật (reverse-engineering) các tay cầm DualShock vì sở thích/đam mê của một người dùng mạng ngẫu nhiên.",
    "Through": "Thông qua",
    "this research": "nghiên cứu này",
    ", it was discovered that there exist some undocumented commands on DualShock controllers that can be sent via USB and are used during factory assembly process. If these commands are sent, the controller starts the recalibration of analog sticks.": ", tôi đã phát hiện ra một số lệnh không được tài liệu hóa trên tay cầm DualShock có thể được gửi qua USB và được sử dụng trong quá trình lắp ráp tại nhà máy. Nếu các lệnh này được gửi, tay cầm sẽ bắt đầu quy trình hiệu chỉnh lại cần analog.",
    "While the primary focus of this research wasn't initially centered on recalibration, it became apparent that a service offering this capability could greatly benefit numerous individuals. And thus, here we are.": "Dù trọng tâm ban đầu của nghiên cứu không phải là hiệu chỉnh lại, nhưng rõ ràng là một dịch vụ cung cấp khả năng này có thể mang lại lợi ích lớn cho nhiều người. Và thế là nó ra đời.",
    "Does the calibration remain effective during gameplay on PS4/PS5?": "Hiệu chỉnh này có duy trì hiệu quả khi chơi game trên PS4/PS5 không?",
    "Yes, if you tick the checkbox \"Write changes permanently in the controller\". In that case, the calibration is flashed directly in the controller firmware. This ensures that it remains in place regardless of the console it's connected to.": "Có, nếu bạn chọn ô \"Lưu các thay đổi vĩnh viễn vào tay cầm\". Khi đó, dữ liệu hiệu chỉnh sẽ được ghi trực tiếp vào firmware của tay cầm. Điều này đảm bảo nó được giữ nguyên bất kể tay cầm được kết nối với console nào.",
    "Is this an officially endorsed service?": "Đây có phải là dịch vụ được Sony chính thức phê duyệt không?",
    "No, this service is simply a creation by a DualShock enthusiast.": "Không, dịch vụ này chỉ là một sáng tạo của một người đam mê DualShock.",
    "Does this website detect if a controller is a clone?": "Trang web này có phát hiện được tay cầm là hàng nhái (clone) không?",
    "Yes, only DualShock4 at the moment. This happened because I accidentally purchased some clones, spent time identifying the differences and added this functionality to prevent future deception.": "Có, nhưng hiện tại chỉ áp dụng cho DualShock4. Điều này xảy ra vì tôi đã vô tình mua phải hàng nhái, sau đó dành thời gian xác định sự khác biệt và thêm chức năng này vào để ngăn chặn việc bị lừa trong tương lai.",
    "Unfortunately, the clones cannot be calibrated anyway, because they only clone the behavior of a DualShock4 during normal gameplay, not all the undocumented functionalities.": "Tiếc là, hàng nhái dù sao cũng không thể được hiệu chỉnh, vì chúng chỉ sao chép hành vi của DualShock4 trong khi chơi game thông thường, chứ không phải tất cả các chức năng không được tài liệu hóa.",
    "If you want to extend this detection functionality to DualSense, please ship me a fake DualSense and you'll see it in few weeks.": "Nếu bạn muốn mở rộng chức năng phát hiện này cho DualSense, hãy gửi cho tôi một cái DualSense giả và bạn sẽ thấy nó hoạt động trong vài tuần.",
    "What development is in plan?": "Những kế hoạch phát triển nào đang được dự kiến?",
    "I maintain two separate to-do lists for this project, although the priority has yet to be established.": "Tôi đang duy trì hai danh sách công việc riêng biệt cho dự án này, dù thứ tự ưu tiên vẫn chưa được xác định.",
    "The first list is about enhancing support for DualShock4 and DualSense controllers:": "Danh sách đầu tiên là về việc nâng cao hỗ trợ cho các tay cầm DualShock4 và DualSense:",
    "Implement calibration of L2/R2 triggers.": "Thực hiện hiệu chỉnh cò (trigger) L2/R2.",
    "Improve detection of clones, particularly beneficial for those seeking to purchase used controllers with assurance of authenticity.": "Cải thiện khả năng phát hiện hàng nhái, đặc biệt có lợi cho những người muốn mua tay cầm đã qua sử dụng với sự đảm bảo về tính xác thực.",
    "Enhance user interface (e.g. provide additional controller information)": "Cải thiện giao diện người dùng (ví dụ: cung cấp thêm thông tin về tay cầm)",
    "Add support for recalibrating IMUs.": "Thêm hỗ trợ hiệu chỉnh lại IMU (đơn vị đo lường quán tính).",
    "Additionally, explore the possibility of reviving non-functioning DualShock controllers (further discussion available on Discord for interested parties).": "Ngoài ra, khám phá khả năng khôi phục các tay cầm DualShock không hoạt động (thông tin chi tiết hơn có trên Discord cho những ai quan tâm).",
    "The second list contains new controllers I aim to support:": "Danh sách thứ hai bao gồm các tay cầm mới mà tôi đặt mục tiêu hỗ trợ:",
    "DualSense Edge": "DualSense Edge",
    "DualShock 3": "DualShock 3",
    "XBox Controllers": "Tay cầm Xbox",
    "Each of these tasks presents both immense interest and significant time investment. To provide context, supporting a new controller typically demands 6-12 months of full-time research, alongside a stroke of good fortune.": "Mỗi nhiệm vụ này đều vô cùng thú vị nhưng cũng tốn rất nhiều thời gian. Để bạn dễ hình dung, việc hỗ trợ một tay cầm mới thường đòi hỏi từ 6 đến 12 tháng nghiên cứu toàn thời gian, cùng với một chút may mắn.",
    "I love this service, it helped me! How can I contribute?": "Tôi thích dịch vụ này, nó đã giúp tôi! Làm thế nào tôi có thể đóng góp?",
    "I'm glad to hear that you found this helpful! If you're interested in contributing, here are a few ways you can help me:": "Tôi rất vui khi biết bạn thấy nó hữu ích! Nếu bạn muốn đóng góp, đây là một vài cách bạn có thể giúp tôi:",
    "Consider making a": "Bạn có thể cân nhắc ",
    "donation": "quyên góp",
    "to support my late-night caffeine-fueled reverse-engineering efforts.": "để ủng hộ những nỗ lực đảo ngược kỹ thuật thâu đêm với cà phê của tôi.",
    "Ship me a controller you would love to add (send me an email for organization).": "Gửi cho tôi một tay cầm mà bạn muốn được thêm hỗ trợ (gửi email cho tôi để sắp xếp).",
    "Translate this website in your language": "Dịch trang web này sang ngôn ngữ của bạn",
    ", to help more people like you!": ", để giúp đỡ nhiều người khác giống như bạn!",
    "This website uses analytics to improve the service.": "Trang web này sử dụng phân tích (analytics) để cải thiện dịch vụ.",
    "Board Model": "Mẫu Bo Mạch",
    "This feature is experimental.": "Tính năng này đang trong giai đoạn thử nghiệm.",
    "Please let me know if the board model of your controller is not detected correctly.": "Vui lòng cho tôi biết nếu mẫu bo mạch của tay cầm bạn không được nhận diện chính xác.",
    "Board model detection thanks to": "Phát hiện mẫu bo mạch nhờ vào",
    "This DualSense controller has outdated firmware.": "Tay cầm DualSense này có firmware đã cũ.",
    "Please update the firmware and try again.": "Vui lòng cập nhật firmware và thử lại.",
    "Joystick Info": "Thông tin Cần Analog",
    "Check circularity": "Kiểm tra độ tròn (Circularity)",
    "Can I reset a permanent calibration to previous calibration?": "Tôi có thể hoàn tác hiệu chỉnh vĩnh viễn về hiệu chỉnh trước đó không?",
    "No.": "Không.",
    "Can you overwrite a permanent calibration?": "Bạn có thể ghi đè (overwrite) một hiệu chỉnh vĩnh viễn không?",
    "Yes. Simply do another permanent calibration.": "Có. Chỉ cần thực hiện một lần hiệu chỉnh vĩnh viễn khác.",
    "Does this software resolve stickdrift?": "Phần mềm này có khắc phục được lỗi trôi cần analog (stickdrift) không?",
    "Stickdrift is caused by a physical defect; namely dirt, worn potentiometer or in some cases a worn spring.": "Trôi cần analog là do lỗi vật lý, cụ thể là bụi bẩn, chiết áp (potentiometer) bị mòn hoặc trong một số trường hợp là lò xo bị mòn.",
    "This software will not fix stick drift on its own if you already experience that. What it will help with, is ensuring the new joystick(s) will function properly after replacing the old one(s) to work well with.": "Phần mềm này sẽ không tự mình sửa được lỗi trôi cần analog nếu bạn đã gặp phải. Nó sẽ giúp đảm bảo các cần analog mới hoạt động tốt sau khi bạn thay thế cần analog cũ.",
    "I have noticed some controllers out of the box have worse factory calibration than if I would recalibrate them. Especially true for circularity of SCUF controllers with a unique shell.": "Tôi nhận thấy một số tay cầm mới mua có hiệu chỉnh tại nhà máy kém hơn so với việc tự hiệu chỉnh. Điều này đặc biệt đúng với độ tròn của các tay cầm SCUF có vỏ độc đáo.",
    "(Dualsense) Will updating the firmware reset calibration?": "(Dualsense) Việc cập nhật firmware có đặt lại hiệu chỉnh không?",
    "After range calibration, joysticks always go in corners.": "Sau khi hiệu chỉnh phạm vi, các cần analog luôn bị lệch về các góc.",
    "This issue happens because you have clicked \"Done\" immediately after starting a range calibration.": "Vấn đề này xảy ra vì bạn đã nhấn \"Hoàn tất\" ngay sau khi bắt đầu hiệu chỉnh phạm vi.",
    "Please read the instructions.": "Vui lòng đọc hướng dẫn.",
    "You have to rotate the joysticks before you press \"Done\".": "Bạn phải xoay các cần analog trước khi nhấn \"Hoàn tất\".",
    "Make sure to touch the edges of the joystick frame and rotate slowly, preferably in each direction - clockwise and anti-clockwise.": "Đảm bảo xoay các cần analog chạm vào các cạnh của khung và xoay chậm, tốt nhất là theo cả hai hướng - kim đồng hồ và ngược kim đồng hồ.",
    "Only after you have done that, you click on \"Done\".": "Chỉ sau khi bạn đã làm điều đó, hãy nhấn \"Hoàn tất\".",
    "Changes saved successfully": "Thay đổi đã được lưu thành công",
    "Error while saving changes": "Lỗi khi lưu các thay đổi:",
    "Save changes permanently": "Lưu các thay đổi vĩnh viễn",
    "Reboot controller": "Khởi động lại tay cầm",
    "Controller Info": "Thông tin Tay cầm",
    "Debug Info": "Thông tin Gỡ lỗi",
    "Software": "Phần mềm",
    "Hardware": "Phần cứng",
    "FW Build Date": "Ngày Build FW",
    "FW Type": "Loại FW",
    "FW Series": "Series FW",
    "FW Version": "Phiên bản FW",
    "FW Update": "Cập nhật FW",
    "FW Update Info": "Thông tin Cập nhật FW",
    "SBL FW Version": "Phiên bản FW SBL",
    "Venom FW Version": "Phiên bản FW Venom",
    "Spider FW Version": "Phiên bản FW Spider",
    "Touchpad FW Version": "Phiên bản FW Touchpad",
    "Serial Number": "Số Sê-ri",
    "MCU Unique ID": "ID Duy Nhất MCU",
    "PCBA ID": "ID PCBA",
    "Battery Barcode": "Mã Vạch Pin",
    "VCM Left Barcode": "Mã Vạch VCM Trái",
    "VCM Right Barcode": "Mã Vạch VCM Phải",
    "HW Model": "Mẫu Phần Cứng (HW)",
    "Touchpad ID": "ID Touchpad",
    "Bluetooth Address": "Địa Chỉ Bluetooth",
    "Show all": "Hiển thị tất cả",
    "Finetune stick calibration": "Hiệu chỉnh chi tiết cần analog",
    "(beta)": "(beta)",
    "Left stick": "Cần analog trái",
    "Right stick": "Cần analog phải",
    "Cancel": "Hủy",
    "<b>Externally</b>: by applying +1.8V directly to the visible test point without opening the controller.": "<b>Bên ngoài</b>: bằng cách cấp điện áp +1.8V trực tiếp vào điểm kiểm tra (test point) hiển thị mà không cần mở tay cầm.",
    "<b>Internally</b>: by soldering a wire from a +1.8V source to the write-protect TP.": "<b>Bên trong</b>: bằng cách hàn một dây từ nguồn +1.8V đến điểm kiểm tra chống ghi (write-protect TP).",
    "Calibration is being stored in the stick modules.": "Đang lưu trữ dữ liệu hiệu chỉnh vào các mô-đun cần analog.",
    "DualSense Edge Calibration": "Hiệu chỉnh DualSense Edge",
    "For more info or help, feel free to reach out on Discord.": "Để biết thêm thông tin hoặc cần hỗ trợ, bạn vui lòng liên hệ trên Discord.",
    "More details and images": "Thông tin chi tiết và hình ảnh thêm",
    "Please connect a DualShock 4, a DualSense or DualSense Edge controller to your computer and press Connect.": "Vui lòng kết nối tay cầm DualShock 4, DualSense hoặc DualSense Edge với máy tính của bạn và nhấn Kết Nối.",
    "Please note: the stick modules on the DS Edge <b>cannot be calibrated via software alone</b>.": "Xin lưu ý: các mô-đun cần analog trên DS Edge <b>không thể được hiệu chỉnh chỉ bằng phần mềm</b>.",
    "To store a custom calibration on the stick's internal memory, a <b>hardware modification</b> is required.": "Để lưu trữ hiệu chỉnh tùy chỉnh vào bộ nhớ trong của cần analog, cần phải có một <b>thao tác điều chỉnh phần cứng</b>.",
    "Support for calibrating DualSense Edge stick modules is now available as an <b>experimental feature</b>.": "Hỗ trợ hiệu chỉnh các mô-đun cần analog của DualSense Edge hiện đã có sẵn dưới dạng <b>tính năng thử nghiệm</b>.",
    "The device appears to be a clone. All calibration functionality is disabled.": "Thiết bị này dường như là hàng nhái. Tất cả chức năng hiệu chỉnh đã bị vô hiệu hóa.",
    "This involves temporarily disabling write protection by applying <b>+1.8V</b> to a specific test point on each module.": "Điều này liên quan đến việc tạm thời tắt bảo vệ ghi (write protection) bằng cách cấp điện áp <b>+1.8V</b> vào một điểm kiểm tra cụ thể trên mỗi mô-đun.",
    "This is only for advanced users. If you're not sure what you're doing, please do not attempt it.": "Thủ tục này chỉ dành cho người dùng có kinh nghiệm. Nếu bạn không chắc chắn về những gì mình đang làm, vui lòng không thực hiện.",
    "We are not responsible for any damage caused by attempting this modification.": "Chúng tôi không chịu trách nhiệm cho bất kỳ thiệt hại nào do việc cố gắng thực hiện thao tác điều chỉnh này gây ra.",
    "You can do this in two ways:": "Bạn có thể thực hiện điều này theo hai cách:",
    "here": "tại đây",
    "Cannot lock": "Không thể khóa",
    "Cannot store data into": "Không thể lưu dữ liệu vào",
    "Cannot unlock": "Không thể mở khóa",
    "Color": "Màu sắc",
    "Color detection thanks to": "Phát hiện màu sắc nhờ vào",
    "If the calibration is not stored permanently, please double-check the wirings of the hardware mod.": "Nếu hiệu chỉnh không được lưu vĩnh viễn, vui lòng kiểm tra lại các dây nối của thao tác điều chỉnh phần cứng.",
    "Left Module Barcode": "Mã Vạch Mô-đun Trái",
    "Right Module Barcode": "Mã Vạch Mô-đun Phải",
    "left module": "mô-đun trái",
    "right module": "mô-đun phải",
    "30th Anniversary": "Kỷ niệm 30 năm",
    "Astro Bot": "Astro Bot",
    "Cobalt Blue": "Lam Cobalt",
    "Cosmic Red": "Đỏ Vũ Trụ",
    "Galactic Purple": "Tím Thiên Hà",
    "God of War Ragnarok": "God of War Ragnarok",
    "Grey Camouflage": "Rằn Ri Xám",
    "Midnight Black": "Đen Huyền Bí",
    "Nova Pink": "Hồng Nova",
    "Starlight Blue": "Xanh Ánh Sao",
    "Sterling Silver": "Bạc Sterling",
    "Volcanic Red": "Đỏ Núi Lửa",
    "White": "Trắng Nguyên Bản",
    "Chroma Indigo": "Chroma Indigo",
    "Chroma Pearl": "Chroma Pearl",
    "Chroma Teal": "Chroma Teal",
    "Fortnite": "Fortnite",
    "Spider-Man 2": "Spider-Man 2",
    "The Last of Us": "The Last of Us",
    "10x zoom": "Phóng to 10x",
    "Normal": "Thông thường",
    "Calibration": "Hiệu chỉnh",
    "Debug": "Gỡ lỗi",
    "Info": "Thông tin",
    "Center (L1)": "Trung tâm (L1)",
    "Circularity (R1)": "Độ tròn (R1)",
    "Move the stick to select it for tuning, then without touching the stick use the D-pad buttons to adjust the center point. Flick it and adjust it again if it is off center or flickers.": "Di chuyển cần analog để chọn và bắt đầu hiệu chỉnh, sau đó không chạm vào cần analog nữa mà dùng các nút D-pad để điều chỉnh điểm trung tâm. Hãy chạm nhẹ cần analog rồi điều chỉnh lại nếu nó bị lệch tâm hoặc bị trôi.",
    "Please release the stick to center position before adjusting with D-pad buttons.": "Vui lòng thả cần analog về vị trí trung tâm trước khi điều chỉnh bằng các nút D-pad.",
    "Press the D-pad or face buttons in the direction you want the stick position to move.": "Nhấn D-pad hoặc các nút chức năng theo hướng bạn muốn vị trí cần analog di chuyển.",
    "Push the stick straight up/down/left/right as far as possible.": "Đẩy cần analog thẳng lên/xuống/trái/phải hết mức có thể.",
    "Show raw numbers": "Hiển thị dữ liệu thô",
    "<strong>Average circularity error:</strong> smaller is not always better! Aim for 7-9 %.": "<strong>Lỗi độ tròn trung bình:</strong> chỉ số nhỏ hơn không phải lúc nào cũng tốt hơn! Mục tiêu là 7–9 %.",
    "A reboot is needed to continue using this DualSense Edge. Please disconnect and reconnect your controller.": "Cần phải khởi động lại để tiếp tục sử dụng DualSense Edge này. Vui lòng ngắt kết nối và kết nối lại tay cầm của bạn.",
    "Adaptive Trigger": "Adaptive Trigger",
    "Adaptive triggers are only supported on DualSense controllers": "Adaptive Trigger chỉ được hỗ trợ trên tay cầm DualSense",
    "Add test": "Thêm bài kiểm tra",
    "Be gentle to avoid damage.": "Thao tác nhẹ nhàng để tránh hư hỏng.",
    "Buttons": "Các nút bấm",
    "Center": "Trung tâm",
    "Circularity": "Độ tròn",
    "Controller does not support adaptive trigger control": "Tay cầm không hỗ trợ điều khiển adaptive trigger",
    "Don't show again": "Không hiển thị lại",
    "Fail": "Thất bại",
    "Failed": "Thất bại",
    "Failed to connect to device": "Kết nối với thiết bị không thành công",
    "Failed to disable adaptive trigger": "Không thể tắt adaptive trigger",
    "Failed to set speaker tone": "Không thể kích hoạt âm báo từ loa",
    "Failed to set vibration": "Không thể cài đặt độ rung",
    "Feel for vibration in the controller.": "Cảm nhận độ rung trong tay cầm.",
    "Haptic Vibration": "Rung phản hồi (Haptic feedback)",
    "Headphone Jack": "Cổng cắm tai nghe",
    "Increase non-circularity": "Tăng độ không tròn",
    "Instructions": "Hướng dẫn",
    "Keep rotating the sticks even if you see no progress!": "Tiếp tục xoay các cần analog ngay cả khi bạn không thấy tiến trình nào!",
    "Learn more...": "Tìm hiểu thêm...",
    "Lights": "Đèn",
    "Listen for a tone from the controller speaker.": "Lắng nghe âm báo phát ra từ loa của tay cầm.",
    "Long-press [circle] to skip ahead.": "Nhấn giữ [nút tròn] để bỏ qua.",
    "Microphone": "Micro",
    "Microphone Level:": "Mức Micro:",
    "No controller connected": "Chưa kết nối tay cầm",
    "No tests completed yet.": "Chưa hoàn thành bài kiểm tra nào.",
    "Not tested": "Chưa kiểm tra",
    "Pass": "Thành công",
    "Passed": "Thành công",
    "Plug in headphones to the 3.5mm jack": "Cắm tai nghe vào cổng 3.5mm",
    "Press L2 and R2 triggers to feel the trigger resistance.": "Nhấn cò L2 và R2 để cảm nhận lực cản của cò.",
    "Press [circle] to close, or [square] to start over": "Nhấn [nút tròn] để đóng, hoặc [nút vuông] để bắt đầu lại",
    "Press [square] to Pass, [cross] to Fail, or [circle] to skip.": "Nhấn [nút vuông] để Đạt, [nút chéo] để Không Đạt, hoặc [nút tròn] để bỏ qua.",
    "Press [square] to begin or [circle] to close": "Nhấn [nút vuông] để bắt đầu hoặc [nút tròn] để đóng",
    "Press [triangle] to go back.": "Nhấn [nút tam giác] để quay lại.",
    "Press each button until they turn green.": "Nhấn từng nút cho đến khi chúng chuyển sang màu xanh lá cây.",
    "Progress": "Tiến trình",
    "Quick Test": "Kiểm tra nhanh",
    "Quick calibrate": "Hiệu chỉnh nhanh",
    "Range calibration appears to have failed. Please try again and make sure you rotate the sticks.": "Hiệu chỉnh phạm vi có vẻ không thành công. Vui lòng thử lại và đảm bảo rằng bạn đã xoay các cần analog.",
    "Repeat": "Lặp lại",
    "Restart": "Khởi động lại",
    "Rotate the sticks slowly at least 2 times in one direction and 2 times in the other direction to cover the whole range.": "Xoay chậm các cần analog ít nhất 2 lần theo một hướng và 2 lần theo hướng ngược lại để bao phủ toàn bộ phạm vi.",
    "Run through these tests to verify your controller's functionality.": "Thực hiện các bài kiểm tra này để xác minh chức năng của tay cầm.",
    "Sony controllers come from the factory calibrated to have an average circularity error of nearly 10 %, and this is now what games expect. Too perfect circularity can make movements and aim feel stiff and unresponsive in some games.": "Tay cầm Sony được hiệu chỉnh tại nhà máy với lỗi độ tròn trung bình gần 10 %, và đây là mức mà các trò chơi mong đợi. Độ tròn quá hoàn hảo có thể khiến chuyển động và mục tiêu trở nên cứng nhắc và kém phản hồi trong một số trò chơi.",
    "Speaker": "Loa",
    "Step size": "Kích thước bước",
    "Test Speaker": "Kiểm tra Loa",
    "Click Test Speaker to listen for the tone through the headphones": "Nhấn Kiểm tra loa để nghe âm thanh qua tai nghe",
    "Test Summary": "Tóm tắt bài kiểm tra",
    "Test all buttons, or long-press [square] to Pass and [cross] to Fail, or [circle] to skip.": "Kiểm tra tất cả các nút, hoặc nhấn giữ [nút vuông] để Đạt và [nút chéo] để Không Đạt, hoặc [nút tròn] để bỏ qua.",
    "The <b>Done</b> button will unlock after at most 15 seconds. If you press <b>Done</b> without rotating the sticks, the calibration will be incomplete and you will need to repeat it.": "Nút <b>Hoàn tất</b> sẽ được mở khóa sau tối đa 15 giây. Nếu bạn nhấn <b>Hoàn tất</b> mà không xoay các cần analog, quá trình hiệu chỉnh sẽ không hoàn thành và bạn sẽ cần lặp lại.",
    "The device is connected via Bluetooth. Disconnect and reconnect using a USB cable instead.": "Thiết bị được kết nối qua Bluetooth. Vui lòng ngắt kết nối và kết nối lại bằng cáp USB.",
    "This test checks all controller buttons by requiring you to press each button up to three times.": "Bài kiểm tra này kiểm tra tất cả các nút trên tay cầm bằng cách yêu cầu bạn nhấn từng nút tối đa ba lần.",
    "This test checks the headphone jack functionality.": "Bài kiểm tra này kiểm tra chức năng của cổng cắm tai nghe.",
    "This test checks the reliability of the USB port.": "Bài kiểm tra này kiểm tra độ tin cậy của cổng USB.",
    "This test will cycle through red, green, and blue colors on the controller lightbar, animate the player indicator lights, and flash the mute button.": "Bài kiểm tra này sẽ chuyển đổi qua các màu đỏ, xanh lá và xanh dương trên thanh đèn của tay cầm, làm sáng các đèn báo người chơi và nhấp nháy nút tắt tiếng.",
    "This test will enable heavy resistance on both L2 and R2 triggers.": "Bài kiểm tra này sẽ kích hoạt lực cản nặng trên cả hai cò L2 và R2.",
    "USB Connector": "Cổng kết nối USB",
    "Watch the controller lights change colors, the player lights animate, and the mute button flash.": "Quan sát đèn của tay cầm thay đổi màu, đèn báo người chơi sáng lên và nút tắt tiếng nhấp nháy.",
    "While holding the stick to be adjusted straight up/down/left/right, make adjustments until you see lightblue sectors in all four directions after circling the stick both left and right. Then use the": "Trong khi giữ cần analog cần điều chỉnh thẳng lên/xuống/trái/phải, thực hiện điều chỉnh cho đến khi bạn thấy các khu vực màu xanh lam nhạt ở cả bốn hướng sau khi xoay cần analog cả sang trái và sang phải. Sau đó sử dụng",
    "Wiggle the USB cable to see if the controller disconnects.": "Lắc nhẹ cáp USB để xem tay cầm có bị ngắt kết nối không.",
    "Your device might not be a genuine Sony controller. If it is not a clone then please report this issue.": "Thiết bị của bạn có thể không phải là tay cầm Sony chính hãng. Nếu nó không phải là hàng nhái, vui lòng báo cáo sự cố này.",
    "failed": "thất bại",
    "hide": "Ẩn",
    "passed": "thành công",
    "skipped": "bỏ qua",
    "tests completed": "bài kiểm tra đã hoàn thành",
    "to increase the non-circularity.": "để tăng độ không tròn.",
    "This test will monitor the controller's microphone input levels": "Bài kiểm tra này sẽ theo dõi mức âm lượng đầu vào micro trên tay cầm",
    "Blow gently into the controller's microphone. You should see the audio level indicator respond": "Hãy thổi nhẹ vào micro của tay cầm và theo dõi mức âm lượng trên thanh tiến trình",
    "This test will activate the controller's vibration motors, first the heavy one, and then the light one.": "Bài kiểm tra này sẽ kích hoạt các mô-tơ rung của tay cầm, trước tiên là mô-tơ mạnh, sau đó là mô-tơ nhẹ",
    "": ""
}


